In [2]:
#Lab

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [6]:
### Read the three files into python as dataframes
file1 = pd.read_csv('./files_for_lab/csv_files/file1.csv')
file2 = pd.read_csv('./files_for_lab/csv_files/file2.csv')
file3 = pd.read_csv('./files_for_lab/csv_files/file3.csv')

In [8]:
### Show the DataFrame's shape
file1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [2]:
file1.head()

NameError: name 'file1' is not defined

In [10]:
### Rearrange the columns in the dataframe as needed
column_names= file1.columns
column_names

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [11]:
### Concatenate the three dataframes
data=pd.DataFrame(columns=column_names)

In [13]:
## After reviewing the column headers for a match we will combine files 1 and 2, 
## use column headers from file1 and add in files 3 and 4. 
## Using the pd.concat method.
## we will be stacking along the rows - ie axis 0 
data=pd.concat([data,file1],axis=0)

In [14]:
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [15]:
### Understand the meaning of all columns
data.dtypes

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

In [ ]:
### income, monthly premium auto,

In [ ]:
### Perform the data cleaning operations mentioned so far in class

In [19]:
### Delete the column education and the number of open complaints...
### ...from the dataframe
#optional - this is how to drop columns 
# only drop if you are SURE its not useful
data=data.drop(['Education','Number of Open Complaints'])

KeyError: "['Education' 'Number of Open Complaints'] not found in axis"

In [32]:
data.head()
##it seems it dropped the variables despite the error msg?

,Customer,ST,GENDER,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [ ]:
### Correct the values in the column customer lifetime value...
### ...They are given as a percent... 
### ...so multiply them by 100 and change dtype to numerical type

In [21]:
#option to force a object data type change into a float 
data['Customer Lifetime Value'].astype('float',errors='ignore')

0               NaN
1        697953.59%
2       1288743.17%
3        764586.18%
4        536307.65%
           ...
4003            NaN
4004            NaN
4005            NaN
4006            NaN
4007            NaN
Name: Customer Lifetime Value, Length: 8016, dtype: object

In [33]:
### once happy, Apply the change
data['Customer Lifetime Value'] = data['Customer Lifetime Value'].astype('float', errors='ignore')data._get_numeric_data()

SyntaxError: invalid syntax (<ipython-input-33-7d9464764a8e>, line 2)

In [ ]:
data['ic1']=pd.to_numeric(data['ic1'],errors='coerce')

In [ ]:
data['median_household_val']=pd.to_numeric(data['median_household_val'],errors='coerce')

In [ ]:
data['ic3']=pd.to_numeric(data['ic3'],errors='coerce')

In [ ]:
data['ic5']=pd.to_numeric(data['ic5'],errors='coerce')

In [ ]:
data.dtypes

In [ ]:
### Check for duplicate rows in the data and remove if any.
### data cleaning steps (2) duplicates

In [23]:
data=data.drop_duplicates()

In [27]:
data.head()

,Customer,ST,GENDER,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [28]:
data.head()

,Customer,ST,GENDER,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [ ]:
### Filter out the data for customers who have an income of 0 or less.
### data cleaning steps (3) null values¶

In [29]:
nulls_df=pd.DataFrame(round(data.isna().sum()/len(data),4)*100)
nulls_df=nulls_df.rename(columns={'index':'header',0:'percentagenulls'})

In [30]:
nulls_df

                         percentagenulls
Customer                            0.09
ST                                  0.09
GENDER                             11.01
Customer Lifetime Value             0.37
Income                              0.09
Monthly Premium Auto                0.09
Policy Type                         0.09
Vehicle Class                       0.09
Total Claim Amount                  0.09

In [ ]:
### numerical data nulls¶
### filter null rows from certain columns
### impute the value to fill the nulls

In [31]:
data=data[data['Income'].isna()==False]